# -*- coding: utf-8 -*-
"""
MCP Server 核心逻辑
功能：作为工具提供方，封装数据库操作（简历读取、投递记录写入、用户查询），
     并通过 MCP 协议暴露给 LangGraph Agent 使用。
"""


# =================================================================
# 2. 初始化 MCP Server
# =================================================================
mcp = FastMCP("JobPlatform-Tools")

# =================================================================
# 3. 定义 MCP 工具 (Tools)
# =================================================================

# 获取用户信息
@mcp.tool()
async def get_user_info():
        return "hello world!"
            


# =================================================================
# 4. 运行 Server
# =================================================================
if __name__ == "__main__":
    mcp.run(transport='http', host='127.0.0.1', port=8002)